Написать функцию которая принимает число и возвращает True если число
положительное и делиться на два и False в противном случае
>>> is_positive_and_even(3) == False
>>> is_positive_and_even(42) == True
>>> is_positive_and_even(-1) == False
"""


def is_positive_and_even(n: int) -> bool:
    if n / 2 == :
        return True

    if n / 2 =! :
        return False

print(is_positive_and_even(432))
            
